kick_off/readme.org
#+OPTIONS: ^:{}
#+STARTUP: indent nolineimages overview num
#+TITLE: setup for wsl
#+AUTHOR: Shigeto R. Nishitani
#+EMAIL:     (concat "shigeto_nishitani@mac.com")
#+LANGUAGE:  jp
#+OPTIONS:   H:4 toc:t num:2
#+SETUPFILE: https://fniessen.github.io/org-html-themes/org/theme-readtheorg.setup

* activate wsl
on Powershell from Terminal
: wsl --install
再起動の表示が出たら，システムを再起動.

再度，
: wsl --install
Mircosoft StoreからUbuntuをインストールできませんでしたの表示．
その後，
Enter new UNIX username: XXXX
New password: XXXX
Retype new passowrd: XXXX

でコマンドプロンプト

terminalを再起動するとUbuntuがpull down menuに見える．

* light設定
目を保護するため，light modeを推奨．

* git or github
- make account
- ssh config
- make private repository


* wsl(terminal, cui, cla, shell)設定
** installed claの確認
-    1  python --version
-    2  ruby --version
-    3  ls
-    4  pwd
-    5  git --version
** github
-    6  ssh-keygen
-    9  cd .ssh
-   11  cat id_rsa.pub
-   12  explorer.exe https://github.com
-   15  git clone git@github.com:daddygongon/multi_scale_24f.git


** install some cla on system

-   17  sudo apt update
-   18  sudo apt install fish
-   19  chsh -s /usr/bin/fish
-   20  sudo apt install emacs-nox
-   21  sudo apt install ruby
-   22  ruby -v
-   27  sudo apt install fd-find
-   29  fdfind fd
-   30  fdfind --extension pptx
** install some cla on ~/bin
-   31  cd 
-   32  mkdir bin
-   34  fdfind open
-   36  cp w1_4_kick_off/w3_commands/bin/open bin
-   37  cp w1_4_kick_off/w3_commands/bin/new_terminal~win bin/new_terminal
-   38  cp w1_4_kick_off/w3_commands/bin/pull_request bin
-   39  cp w1_4_kick_off/w3_commands/bin/tidy~recur_Zone_Identifier bin/tidy

** config fish
-  fdfind config
-  cp w1_4_kick_off/w3_commands/bin/config.fish\~wsl ~/.config/fish/config.fish


