kick_off/readme.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="jp" xml:lang="jp">
<head>
<!-- 2025-01-28 Tue 17:44 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>setup for wsl</title>
<meta name="author" content="Shigeto R. Nishitani" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
<link rel="stylesheet" type="text/css" href="src/readtheorg_theme/css/search.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">setup for wsl</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org6fbba4a">1. activate wsl</a></li>
<li><a href="#org5d54b6e">2. light設定</a></li>
<li><a href="#orge8a43f5">3. git or github</a></li>
<li><a href="#orga9c7988">4. wsl(terminal, cui, cla, shell)設定</a>
<ul>
<li><a href="#orgaf346a1">4.1. installed claの確認</a></li>
<li><a href="#org3614e73">4.2. github</a></li>
<li><a href="#org0bb616d">4.3. install some cla on system</a></li>
<li><a href="#orgd3e8c73">4.4. install some cla on ~/bin</a></li>
<li><a href="#orge475b4f">4.5. config fish</a></li>
</ul>
</li>
</ul>
</div>
</div>


<div id="outline-container-org6fbba4a" class="outline-2">
<h2 id="org6fbba4a"><span class="section-number-2">1.</span> activate wsl</h2>
<div class="outline-text-2" id="text-1">
<p>
on Powershell from Terminal
</p>
<pre class="example">
wsl --install
</pre>

<p>
再起動の表示が出たら，システムを再起動.
</p>

<p>
再度，
</p>
<pre class="example">
wsl --install
</pre>

<p>
Mircosoft StoreからUbuntuをインストールできませんでしたの表示．
その後，
Enter new UNIX username: XXXX
New password: XXXX
Retype new passowrd: XXXX
</p>

<p>
でコマンドプロンプト
</p>

<p>
terminalを再起動するとUbuntuがpull down menuに見える．
</p>
</div>
</div>

<div id="outline-container-org5d54b6e" class="outline-2">
<h2 id="org5d54b6e"><span class="section-number-2">2.</span> light設定</h2>
<div class="outline-text-2" id="text-2">
<p>
目を保護するため，light modeを推奨．
</p>
</div>
</div>

<div id="outline-container-orge8a43f5" class="outline-2">
<h2 id="orge8a43f5"><span class="section-number-2">3.</span> git or github</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li>make account</li>
<li>ssh config</li>
<li>make private repository</li>
</ul>
</div>
</div>


<div id="outline-container-orga9c7988" class="outline-2">
<h2 id="orga9c7988"><span class="section-number-2">4.</span> wsl(terminal, cui, cla, shell)設定</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-orgaf346a1" class="outline-3">
<h3 id="orgaf346a1"><span class="section-number-3">4.1.</span> installed claの確認</h3>
<div class="outline-text-3" id="text-4-1">
<ul class="org-ul">
<li>1  python &#x2013;version</li>
<li>2  ruby &#x2013;version</li>
<li>3  ls</li>
<li>4  pwd</li>
<li>5  git &#x2013;version</li>
</ul>
</div>
</div>
<div id="outline-container-org3614e73" class="outline-3">
<h3 id="org3614e73"><span class="section-number-3">4.2.</span> github</h3>
<div class="outline-text-3" id="text-4-2">
<ul class="org-ul">
<li>6  ssh-keygen</li>
<li>9  cd .ssh</li>
<li>11  cat id_rsa.pub</li>
<li>12  explorer.exe <a href="https://github.com">https://github.com</a></li>
<li>15  git clone git@github.com:daddygongon/multi_scale_24f.git</li>
</ul>
</div>
</div>


<div id="outline-container-org0bb616d" class="outline-3">
<h3 id="org0bb616d"><span class="section-number-3">4.3.</span> install some cla on system</h3>
<div class="outline-text-3" id="text-4-3">
<ul class="org-ul">
<li>17  sudo apt update</li>
<li>18  sudo apt install fish</li>
<li>19  chsh -s /usr/bin/fish</li>
<li>20  sudo apt install emacs-nox</li>
<li>21  sudo apt install ruby</li>
<li>22  ruby -v</li>
<li>27  sudo apt install fd-find</li>
<li>29  fdfind fd</li>
<li>30  fdfind &#x2013;extension pptx</li>
</ul>
</div>
</div>
<div id="outline-container-orgd3e8c73" class="outline-3">
<h3 id="orgd3e8c73"><span class="section-number-3">4.4.</span> install some cla on ~/bin</h3>
<div class="outline-text-3" id="text-4-4">
<ul class="org-ul">
<li>31  cd</li>
<li>32  mkdir bin</li>
<li>34  fdfind open</li>
<li>36  cp w1_4_kick_off/w3_commands/bin/open bin</li>
<li>37  cp w1_4_kick_off/w3_commands/bin/new_terminal~win bin/new_terminal</li>
<li>38  cp w1_4_kick_off/w3_commands/bin/pull_request bin</li>
<li>39  cp w1_4_kick_off/w3_commands/bin/tidy~recur_Zone_Identifier bin/tidy</li>
</ul>
</div>
</div>

<div id="outline-container-orge475b4f" class="outline-3">
<h3 id="orge475b4f"><span class="section-number-3">4.5.</span> config fish</h3>
<div class="outline-text-3" id="text-4-5">
<ul class="org-ul">
<li>fdfind config</li>
<li>cp w1_4_kick_off/w3_commands/bin/config.fish\~wsl ~/.config/fish/config.fish</li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Shigeto R. Nishitani</p>
<p class="date">Created: 2025-01-28 Tue 17:44</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
